package com.itheima.a08regexdemo;

public class RegexDemo2 {
    public static void main(String[] args) {
        /*验证手机号吗 13112345678 13712345667 13945679027 13945670271
        验证座机电话号码 020-2324242 02122442 0712-3242434
        验证邮箱号码 3232323@qq.com zhangsan@itcast.cnn dlei0009@163.com dlei0009@pci.om.cn
         */
        //心得：拿着一个正确的数据，从左到右依次去写
        //13112345678
        //分成三部分：1、表示手机号码只能以数字1开头
        //2、第二位数字只能是3-9之间
        //3、\\d｛9}任意数字只能出现9次
        String regex1="1[3-9]\\d{9}";
        System.out.println("13112345678".matches(regex1));
        System.out.println("--------------------------------");

        //验证座机电话号码 020-2324242 02122442 0712-3242434
        //思路：
        //需要把座机号分成三部分：1、区号
        // 0\\d{2,3} 一定以0开头、第二三位可以是任意数字，区号可以是三位或四位，所以任意数字可以出现2次到3次
        //2、- ?表示次数 出现1次或0次
        //3、号码 不能以0开头 之后的都可以是任意数字
        String regex2="0\\d{2,3}-?[1-9]\\d{4,9}";
        System.out.println("020-2324242".matches(regex2));

        //验证邮箱号码 3232323@qq.com zhangsan@itcast.cnn dlei0009@163.com dlei0009@pci.om.cn
        //思路：
        //1、@的左边：任意的字母数字下划线至少出现一次 \\w+
        //2、@：只出现一次
        //3.1  .的左边：任意数字字母出现2到6次[\\w&&[^_]{2,6}
        //3.2  .：
        //3.3  .的右边：大小写字母都可以，只出现2到3次
        //把3.2和3.3看成一组 这一组可以出现1次或2次
        String regex3="\\w+@[\\w&&[^_]{2,6}(\\.[a-zA-Z]{2,3}){1,2}";
        System.out.println("3232323@qq.com".matches(regex3));

        //24小时正则表达式：
        String regex4="([01]\\d|2[0-3]):[0-5]\\d:[0-5]\\d";

    }
}
